import 'package:hanzishu/engine/inputgamequestion.dart';

var theInputGameQuestionList = [
  InputGameQuestion(0, "没有比赛。",""),
  InputGameQuestion(1, "这个男孩是学生，也是咖啡店的服务员。那个女孩是他妹妹。","這個男孩是學生，也是咖啡店的服務員。那個女孩是他妹妹。"),
  InputGameQuestion(2, "一些生活在水里的动物，用贝壳保护自己的身体。甲骨文中的贝字就像一种海贝的样子。", "一些生活在水裡的動物，用貝殼保護自己的身體。甲骨文中的貝字就像一種海貝的樣子。"),
  InputGameQuestion(3, "为了看日出，我常常早起。那时天还没有大亮，周围非常清静，船上只有机器的响声。天空还是一片浅蓝，颜色很浅。转眼间天边出现了一道红霞，慢慢地在扩大它的范围，加强它的亮光。我知道太阳要从天边升起来了，便不转眼地望着那里。", "為了看日出，我常常早起。那時天還沒有大亮，周圍非常清靜，船上只有機器的響聲。天空還是一片淺藍，顏色很淺。轉眼間天邊出現了一道紅霞，慢慢地在擴大它的範圍，加強它的亮光。我知道太陽要從天邊升起來了，便不轉眼地望著那裡。"),
  InputGameQuestion(4, "第二天早晨，船驶进邻国宏伟都城的港口。所有教堂的钟都敲响了，高高的塔顶上军号齐鸣，兵士们拿着飘扬的旗子，佩带着闪亮的军刀在敬礼。每天都有欢庆活动，宴会和舞会一个接着一个，可是公主还没有露面。人们说她在一个遥远的地方接受教育，学习各种皇家的美德。最后，她终于来了。室冷灯昏，夜深风急。墙暗影动，窗细声微。被轻难御，露重衣湿。身寒手僵，心惊梦迟。", "第二天早晨，船駛進鄰國宏偉都城的港口。所有教堂的鐘都敲響了，高高的塔頂上軍號齊鳴，兵士們拿著飄揚的旗子，佩帶著閃亮的軍刀在敬禮。每天都有歡慶活動，宴會和舞會一個接著一個，可是公主還沒有露面。人們說她在一個遙遠的地方接受教育，學習各種皇家的美德。最後，她終於來了。"),
  InputGameQuestion(5, "你好！我叫王中，十五岁了。再见！","你好！我叫王中，十五歲了。再見！"),
  InputGameQuestion(6, "我住在上海，它是一个热闹的大城市。每天上学，我会经过公园，看小朋友玩耍。学校里有很多老师和同学，大家都很友好。周末时，我会和家人去南京路逛街，也会吃小笼包和生煎包。", "我住在上海，它是一個熱鬧的大城市。每天上學，我會經過公園，看小朋友玩耍。學校裡有很多老師和同學，大家都很友好。週末時，我會和家人去南京路逛街，也會吃小籠包和生煎包。"),
  InputGameQuestion(7, "暮色渐沉，小城被一层温柔的橙光笼罩。那家陈旧书店静静伫立在街角，门上铜铃随风轻响。店主老人目光沉静，仿佛藏着许多未说出的往事。一位旅人偶然推门而入，在尘封书页间发现一封未寄出的信，字迹温润却略显仓促。信中讲述一段未完成的告别，也留下一个无人解答的疑问。风从门缝吹入，纸页轻轻翻动，仿佛有人低声回应。", "暮色漸沉，小城被一層溫柔的橙光籠罩。那家陳舊書店靜靜佇立在街角，門上銅鈴隨風輕響。店主老人目光沉靜，彷彿藏著許多未說出的往事。一位旅人偶然推門而入，在塵封書頁間發現一封未寄出的信，字跡溫潤卻略顯倉促。信中講述一段未完成的告別，也留下一个無人解答的疑問。風從門縫吹入，紙頁輕輕翻動，彷彿有人低聲回應。"),
  InputGameQuestion(8, "晋太元中，武陵人捕鱼为业。缘溪行，忘路之远近。忽逢桃花林，夹岸数百步，中无杂树，芳草鲜美，落英缤纷。渔人甚异之，复前行，欲穷其林。林尽水源，便得一山，山有小口，仿佛若有光。便舍船，从口入。初极狭，才通人。复行数十步，豁然开朗。", "晉太元中，武陵人捕魚為業。緣溪行，忘路之遠近。忽逢桃花林，夾岸數百步，中無雜樹，芳草鮮美，落英繽紛。漁人甚異之，復前行，欲窮其林。林盡水源，便得一山，山有小口，仿佛若有光。便捨船，從口入。初極狹，才通人。復行數十步，豁然開朗。"),
];