import 'package:hanzishu/engine/inputgamequestion.dart';

var theInputGameQuestionList = [
  InputGameQuestion(0, "没有比赛。",""),
  InputGameQuestion(1, "这个男孩是学生，也是咖啡店的服务员。那个女孩是他妹妹。","這個男孩是學生，也是咖啡店的服務員。那個女孩是他妹妹。"),
  InputGameQuestion(2, "一些生活在水里的动物，用贝壳保护自己的身体。甲骨文中的贝字就像一种海贝的样子。", "一些生活在水裡的動物，用貝殼保護自己的身體。甲骨文中的貝字就像一種海貝的樣子。"),
  InputGameQuestion(3, "为了看日出，我常常早起。那时天还没有大亮，周围非常清静，船上只有机器的响声。天空还是一片浅蓝，颜色很浅。转眼间天边出现了一道红霞，慢慢地在扩大它的范围，加强它的亮光。我知道太阳要从天边升起来了，便不转眼地望着那里。", "為了看日出，我常常早起。那時天還沒有大亮，周圍非常清靜，船上只有機器的響聲。天空還是一片淺藍，顏色很淺。轉眼間天邊出現了一道紅霞，慢慢地在擴大它的範圍，加強它的亮光。我知道太陽要從天邊升起來了，便不轉眼地望著那裡。"),
  InputGameQuestion(4, "第二天早晨，船驶进邻国宏伟都城的港口。所有教堂的钟都敲响了，高高的塔顶上军号齐鸣，兵士们拿着飘扬的旗子，佩带着闪亮的军刀在敬礼。每天都有欢庆活动，宴会和舞会一个接着一个，可是公主还没有露面。人们说她在一个遥远的地方接受教育，学习各种皇家的美德。最后，她终于来了。室冷灯昏，夜深风急。墙暗影动，窗细声微。被轻难御，露重衣湿。身寒手僵，心惊梦迟。", "第二天早晨，船駛進鄰國宏偉都城的港口。所有教堂的鐘都敲響了，高高的塔頂上軍號齊鳴，兵士們拿著飄揚的旗子，佩帶著閃亮的軍刀在敬禮。每天都有歡慶活動，宴會和舞會一個接著一個，可是公主還沒有露面。人們說她在一個遙遠的地方接受教育，學習各種皇家的美德。最後，她終於來了。"),
];