import 'package:hanzishu/engine/thirdpartylesson.dart';


var theThirdPartyContentList = [
  ThirdPartyContent(ThirdPartyType.sunlaoshi, 1, "你好！你好吗？我很好。你呢？我也很好，谢谢。老师好！同学们好！请问，你叫什么名字？他叫什么名字？老师，再见！"),
  ThirdPartyContent(ThirdPartyType.sunlaoshi, 2, "你多大？我十九岁。你是哪国人？我是美国人。他是加拿大人。"),
  ThirdPartyContent(ThirdPartyType.sunlaoshi, 3, "这是我爸爸、妈妈和哥哥。你家有几个人？我家有五个人：爸爸、妈妈、姐姐、妹妹和我。这是我家的狗。你家有什么宠物？有没有狗？没有。我家有两只猫。我很喜欢狗，可是我妈妈喜欢猫。"),
  ThirdPartyContent(ThirdPartyType.sunlaoshi, 4, "这个男孩是谁？那个女孩是他妹妹。他做什么工作？他是学生，也是咖啡店的服务员。他会说什么语言？他会说英语、法语，还会说一点儿汉语。他会不会写汉字？他只会写简单的汉字。"),
  ThirdPartyContent(ThirdPartyType.sunlaoshi, 5, "这个星期有足球比赛，你会去看吗？星期几？什么时候？星期三晚上六点半。好，我去。我也会去。我们六点见吧。现在几点？还没有来！现在差不多六点一刻。对不起！没关系，比赛还没开始呢！我们走吧。"),
  ThirdPartyContent(ThirdPartyType.sunlaoshi, 6, "生日是几月几号？是今天还是明天？是明天，她的生日是十月三号。是吗？有生日派对吗？有！生日快乐！你们都来了！我真高兴！大家吃蛋糕吧！这是我送你的生日礼物，祝你生日快乐！谢谢你！"),
  ThirdPartyContent(ThirdPartyType.sunlaoshi, 7, "欢迎光临！请问，几位？三位。请坐。请问想喝什么？请给我们三杯茶。好。这是我们的菜单。他是个新同学。你喜欢不喜欢吃中国菜？我只喜欢吃饺子。那，我们点一盘饺子，一只烧鸡，一份青菜和一碗酸辣汤。好不好？好。这家饭馆的烧鸡很好吃，我饿了，我们点菜吧。"),
  ThirdPartyContent(ThirdPartyType.sunlaoshi, 8, "酸辣汤真好喝！我喜欢酸辣的味道。烧鸡也不错，青菜的味道怎么样？太咸了。我要叫一碗米饭。你为什么不吃肉？因为我吃素！你不会用筷子吗？不会。我只会用刀子、叉子。试一下吧！我教你。哦，用筷子很简单啊！大家吃饱了吗？今天晚上我请客！"),
  ThirdPartyContent(ThirdPartyType.sunlaoshi, 9, "我来介绍一下，这是室友。你好，很高兴认识你。你好，你住在哪儿？我住在校内。我的公寓在餐厅对面。你们现在去哪儿？我去健身房运动。哦，我也要去图书馆看书。可以不可以跟你一起去？当然可以。回头见。"),
  ThirdPartyContent(ThirdPartyType.sunlaoshi, 10, "喂，你好。你在哪儿？我在宿舍看电视。有事吗？我找不到我的课本了。帮我找一下，好吗？好吧。你的课本在卧室里面吗？可能在我的床上。不在那儿，也不在书桌上。那会在哪儿呢？哦，我找到了！课本就在客厅的沙发下面。太好了！我现在马上回去拿。"),
  ThirdPartyContent(ThirdPartyType.sunlaoshi, 11, "这家商店卖什么东西？这儿卖的东西很多。你看，有衣服，有文具，还有电子用品。我得买一个手机。我很想我爸妈，要给他们打电话。小姐，请问这个手机多少钱？二百九十块九毛九。太贵了！一百块卖不卖？不好意思，手机的价钱是:二百九十块九毛九。这样吧，我给你一百五十块，怎么样？他们这儿不讲价！小姐，有没有便宜一点儿的？我不要便宜的！算了，我们去别的商店看一下吧。"),
  ThirdPartyContent(ThirdPartyType.sunlaoshi, 12, "你为什么还要给她买东西？因为她昨天教我做功课，所以我要谢谢她。你要买这么贵的礼物啊！不用担心，太贵的话我就买别的东西。先生，请问这条项链多少钱？一百二十八块。好，那我就买这条。请问您是付现金还是刷卡？付现金。给你一百三十块。你花了这么多钱，可以吗？没问题。哦，我们走吧！"),
  ThirdPartyContent(ThirdPartyType.sunlaoshi, 13, "你放假的时候有什么计划？我打算去北京，下个月回来。是吗？你老家在北京吗？对，我出生在北京，十岁才来美国，是在加州长大的。北京有什么好玩的？有长城，有故宫，还可以吃北京烤鸭呢！北京这么好玩儿，我也很想去！你家在什么地方？我家在波士顿。我爸是从西班牙来的，我妈是从爱尔兰来的。是吗？我家在加拿大，今年寒假回家,我买了一张火车票。因为飞机票太贵了。对不起，我得走了。祝你们寒假快乐！"),
  ThirdPartyContent(ThirdPartyType.sunlaoshi, 14, "谢谢你开车送我们去机场！不用谢！机场离学校不太远。你知道到机场怎么走吗？当然！我们先一直往前开，到了路口再往左转。不对！我们到路口应该往右转。不对！先往左转，再穿过大街，然后往右转。我们迷路了吗？你们别吵了。小心啊！前面有只猫！哎呀，我还是去坐出租车吧。"),
  ThirdPartyContent(ThirdPartyType.sunlaoshi, 15, "这么多书，你这个学期选了几门课？我选了四门课：英国文学、数学、中文，还有美国历史。你比较喜欢哪门课？我觉得中文课很有意思。二年级的中文课很难，对不对？语法和生词比较容易，可是我的听力太差了，我有时候上课听不懂。你应该多听录音！是的，如果想进步，我只好周末多练习了。这样的话，这个周末你是不是?没时间来参加我的派对了？那怎么行，我听完了录音以后就去！"),
  ThirdPartyContent(ThirdPartyType.sunlaoshi, 16, "好，我先把作业发还给你们。喂，上课了！你今天怎么这么累？你昨天晚上几点才睡觉？我去听音乐会了，昨天晚上十二点才睡觉！我们明天要考试，你准备了吗？我一起床就来上课了，还没有时间准备呢！你觉得考试重要？还是音乐会重要？好了，好了，糟糕！我忘了带我的笔记本了，怎么办？我给你一张纸吧。谢谢。我们昨天学到哪儿？我们已经把第三课念完了。今天学语法。老师正在写语法点呢！我找不到我的笔了，可以借你的吗？上课了！你们还有什么问题吗？没有问题，对不起！"),
];